app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    if (user = User.create(user_params))